backend/app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 70], ["LIMIT", 1]]
---
    def current_user

        user = User.find(session[:user_id])