backend/app/controllers/authentication_controller.rb

    def login

        user = User.find_by({email: params[:email]})
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "f@gmail.com"], ["LIMIT", 1]]