backend/app/controllers/cart_items_controller.rb

INSERT INTO "cart_items" ("cart_id", "item_id", "quantity", "size") VALUES (?, ?, ?, ?)  [["cart_id", 9], ["item_id", 73], ["quantity", 1], ["size", "S"]]
---
def create

    cart_item = CartItem.create({
        cart_id: self.current_user.cart.id,
        item_id: params[:cartItem][:id],
        quantity: 1,
        size: params[:size]
    })

SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 61], ["LIMIT", 1]]
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."id" = ? LIMIT ?  [["id", 132], ["LIMIT", 1]]
UPDATE "cart_items" SET "quantity" = ? WHERE "cart_items"."id" = ?  [["quantity", 0], ["id", 132]]
---
    def update

        cart_item = CartItem.find(params[:id])

        # updated_cart_params = {

        #     cart_id: self.current_user.cart.id,
        #     item_id: cart_item.item_id,
        #     quantity: params[:quantity],
        #     size: cart_item.size

        # }

         cart_item.update({
            quantity: params[:quantity]
        })

SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."id" = ? LIMIT ?  [["id", 112], ["LIMIT", 1]]
DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 112]]
---
    def destroy

        cart_item = CartItem.find(params[:id])
        cart_item.destroy