backend/app/controllers/items_controller.rb

    def index
        items = Item.all
---
SELECT "items".* FROM "items"

    def show
        items = Item.find(params[:id])
---
SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 73], ["LIMIT", 1]]