backend/app/controllers/orders_controller.rb

    def index
        orders = Order.all
---
SELECT "orders".* FROM "orders"

    def create

        user = User.find(params[:order][:user_id])
        items = user.cart.items

        order = Order.create(user_id: user.id, total: params[:total], address: params[:address]);
        user.cart.cart_items.each do |c|
            order_item = OrderItem.create({
                order_id: order.id,
                item_id: c.item_id,
                size: c.size,
                quantity: c.quantity
            })
        end


        user.cart.cart_items.destroy_all
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 70], ["LIMIT", 1]]
INSERT INTO "orders" ("user_id", "total", "created_at", "updated_at", "address") VALUES (?, ?, ?, ?, ?)  [["user_id", 70], ["total", 80.0], ["created_at", "2020-06-15 14:27:01.548122"], ["updated_at", "2020-06-15 14:27:01.548122"], ["address", "2623 Edgefield lakes Dr, Houston, TX 77054"]]
SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 73], ["LIMIT", 1]]
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = ?  [["cart_id", 9]]
SELECT "items".* FROM "items" INNER JOIN "order_items" ON "items"."id" = "order_items"."item_id" WHERE "order_items"."order_id" = ?  [["order_id", 28]]
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = ?  [["order_id", 15]]
INSERT INTO "order_items" ("order_id", "item_id", "quantity", "size", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["order_id", 15], ["item_id", 73], ["quantity", 1], ["size", "S"], ["created_at", "2020-06-15 14:27:01.583902"], ["updated_at", "2020-06-15 14:27:01.583902"]]
DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 113]]