backend/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "Melike@gmail.com"], ["LIMIT", 1]]
INSERT INTO "users" ("first_name", "last_name", "email", "password_digest", "phone_number", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "carts" ("user_id") VALUES (?)  [["user_id", 74]]
---
    def create

        if User.find_by(email: params[:email]) == nil

            user = User.create({
                first_name: params[:first_name],
                last_name: params[:last_name],
                password: params[:password],
                email: params[:email],
                phone_number: params[:phone_number],
                address: params[:address]
            })
            cart = Cart.create({
                user_id: user.id
            })

SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = ?  [["cart_id", 15]]
SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = ? LIMIT ?  [["user_id", 76], ["LIMIT", 1]]
SELECT "items".* FROM "items" INNER JOIN "order_items" ON "items"."id" = "order_items"."item_id" WHERE "order_items"."order_id" = ?  [["order_id", 27]]
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = ?  [["order_id", 27]]
---
    def get_user
        user = {user: self.current_user, cart_items: self.current_user.cart.cart_items.as_json(include: :item), orders: self.current_user.orders.as_json(include: [:items, :order_items])}